// [FILEPATH] src/constants/nicknameData.ts

export const ADJECTIVES: string[] = [
  '용감한', '슬기로운', '친절한', '빛나는', '행복한',
  '고요한', '현명한', '재빠른', '강력한', '우아한',
  '상냥한', '매력적인', '총명한', '근엄한', '진지한',
  '귀여운', '깜찍한', '엉뚱한', '수줍은', '씩씩한', '기발한',
  '똘망한', '대담한', '창의적인', '버뜩이는'
];

export const NOUNS: string[] = [
  '호랑이', '사자', '독수리', '돌고래', '다람쥐',
  '코뿔소', '치타', '매머드', '유니콘', '드래곤',
  '기린', '고라니', '두루미', '너구리', '미어캣',
  '태승쨩', '태승찡', '태승쿤', '타이승', '슈', '규', '광혀니', '동혀니', '우지니', // 공포의 외인구단 멤버들
  '해달', '알파카', '펭귄', '피닉스', '몽상가', 
  '초코송이'
];
